/*
  BOOT with MS FW
*/

#include "common.h"

// log switch
#define LOG_SETUP 0

//#define SHOW_REBOOT_ARGS

#define USE_PRELOAD_ME_AREA 0

//
#define KEEP_PRX_BY_NAME 0

// short cut to return 1.50
#define RETURN_OS_MASK (ALL_ALLOW|ALL_TRIGGER|ALL_FUNCTION)
#define RETURN_OS_KEY  (PSP_CTRL_UP | PSP_CTRL_RTRIGGER | PSP_CTRL_LTRIGGER)

/****************************************************************************
****************************************************************************/

static const char conftbl_path[] = "/kd/pspcnf_tbl.txt";
const char normal_os_path[] = "ms0:/dh/kd";
const char flash_os_path[]  = "flash0:/dhcommon";
const char reboot_bin_path[]  = "/reboot.bin";
const char patcher_path[] = "/kd/msreboot.bin";
//const char patcher_path[] = "/msreboot.bin";

static int reboot_normal = 0;

/****************************************************************************
****************************************************************************/
static unsigned int *loadexec_cseg;
static unsigned int *loadexec_GZipPoint;

/* return function from reboot hook */
static int (*setup_return_func)(int arg1,int arg2,int arg3,int arg4,int arg5,int arg6);
static int (*setup2_return_func)(int arg1,int arg2,int arg3,int arg4,int arg5,int arg6);

/****************************************************************************
halt
*****************************************************************************/
static void halt(void)
{
	Kprintf("reboot HALT");
	while(1);
}


--------------------------------------------------------

return vsh
--------------------------------------------------------
-hook_reboot_entry(88400040,8829EC90,00000210,7D834457):0
--------------------------------------------------------
*/
static void hook_reboot_entry(u32 arg1,u32 arg2,u32 arg3,u32 arg4)
{
	void (*func)(u32 arg1,u32 arg2,u32 arg3,u32 arg4);
#ifdef SHOW_REBOOT_ARGS
{
	int i;
	unsigned int *ptr;
	unsigned int *pchar;

Kprintf("-------------------------------------------------------\n");
Kprintf("hook_reboot_entry(%08X,%08X,%08X,%08X):%d\n",arg1,arg2,arg3,arg4,reboot_normal);

	// args表示
	Kprintf("reboot.img start\n");
	Kprintf("ARG1:",arg1);
	for(i=0;i<10;i++)
		Kprintf("%08X ",((unsigned int **)arg1)[i]);
	Kprintf("\n");

	Kprintf("ARG2:\n",arg2);
	for(i=0;i<8;i++)
		Kprintf("%08X ",((unsigned int **)arg2)[i]);
	Kprintf("\n");

	Kprintf("ARG3(api type) %08X\n",arg3);

	Kprintf("ARG14:");
	for(i=0;i<8;i++)
		Kprintf("%08X ",((unsigned int **)arg1)[4][i]);
	Kprintf("\n");

	Kprintf("ARG15:");
	for(i=0;i<8;i++)
		Kprintf("%08X ",((unsigned int **)arg1)[5][i]);
	Kprintf("\n");

	// ARG18
// 'disc0:/PSP_GAME/SYSDIR/EBOOT.BIN',00000021,00000002 VSH UMD boot
// '',00000400,00000100 : VSH

//  'disc0:/PSP_GAME/USRDIR/INV/INVMONO.prx',00000027,00000002

	pchar = (unsigned char *) (((unsigned char **)arg1)[8]);
	Kprintf("ARG18: boot path '%s',0x%X,0x%X\n",pchar[0],pchar[1],pchar[2]);

	// ARG2
	// boot name
// 'vsh'   '/kd/popbtconf.txt' : VSH 
// 'game' '/kd/popbtconf.txt' : VSH UMD boot
// 'game' 'NULL' LoadExec
	Kprintf("ARG23:boot select '%s'\n",((unsigned char **)arg2)[3]);
	Kprintf("ARG26:table name  '%s'\n",((unsigned char **)arg2)[6]);

/*
88400040
--ARG1[0] 88000000 // Kernel TOP address ?
--ARG1[1] 02000000
--ARG1[2] 00000000
--ARG1[3] 00000000
--ARG1[4] 88400840 pointer
--ARG1[5] 8841CBC0 pointer
--ARG1[6] 00000001
--ARG1[7] 00000001
--ARG1[8] 8841C840 : boot path
--ARG1[9] FFFFFFFF
--ARG1[10] 00000000

8826AE90
--ARG2[0] 00000024
--ARG2[1] 00000000
--ARG2[2] 00000000
--ARG2[3] 8826AEC0 : boot select name 'game'
--ARG2[4] 00000000
--ARG2[5] 00000000
--ARG2[6] 8826AFC0 : boot table name NULL / 'pspconftbl.txt'
--ARG2[7] 00000000
--ARG2[8] 00010000
--ARG2[9] FFFFFFFF
--ARG2[10] FFFFFFFF
--ARG2[11] FFFFFFFF
8826AEC0

*/

Kprintf("-------------------------------------------------------\n");
}
#endif
	func = reboot_normal ? (void *)0x88c00000 : (void *)PATCHER_ADDR;
	func(arg1,arg2,arg3,arg4);
}

#if 0
/****************************************************************************
check escape devhook
*****************************************************************************/
static int escape_devhook_req(void)
{
	SceCtrlData pad;

	// L+R+UP が押されてる時は、強制リターン
	sceCtrlPeekBufferPositive(&pad,1);
	return (pad.Buttons & RETURN_OS_MASK) == RETURN_OS_KEY;
}
#endif

#if 0
/****************************************************************************
make free area
*****************************************************************************/
/*
typedef struct SceModule {
	struct SceModule	*next;
	unsigned short		attribute;   // 04
	unsigned char		version[2];  // 06
	char				modname[27]; // 08
	char				terminal;
	unsigned int		unknown1;    // 24
	unsigned int		unknown2;    // 28
	SceUID				modid;       // 2c
	unsigned int		unknown3[4]; // 30
	void *				ent_top;     // 34
	unsigned int		ent_size;    // 38
	void *				stub_top;
	unsigned int		stub_size;   // 40

unk4[0] == StartModuleEntry


	unsigned int		unknown4[4]; // 44
	unsigned int		entry_addr;  // 54
	unsigned int		gp_value;    // 5c
	unsigned int		text_addr;   // 60
	unsigned int		text_size;   // 64
	unsigned int		data_size;
	unsigned int		bss_size;
	unsigned int		nsegment;
	unsigned int		segmentaddr[4];
	unsigned int		segmentsize[4];
} SceModule;
*/

int  LoadCoreForKernel_929b5c69(int *);
//SceModuleInfo *sceKernelFindModuleByUID(SceUID);
//int sceKernelReleaseModule(SceModule *);
//int sceKernelDeleteModule(SceModule *);
#endif


#if 1

/////////////////////////////////////////////////////////////////////////////////
int SysMemForKernel_a089eca4(u32 arg1,u32 arg2,u32 arg3);
HOOKAPI_resotre res_SysMemForKernel_a089eca4;

int hook_SysMemForKernel_a089eca4(u32 arg1,u32 arg2,u32 arg3)
{
	restoreAPIDirect(&res_SysMemForKernel_a089eca4);
//Kprintf("hook_SysMemForKernel_a089eca4(%08X,%08X,%08X)\n",arg1,arg2,arg3);
	return 0;
}

/****************************************************************************
  preload boot prx

sceKernelGetModuleListWithAlloc

 ****************************************************************************/
